In [1]:
from sqlalchemy import create_engine
import pandas as pd

In [2]:
engine = create_engine('postgresql+psycopg2://root:root@localhost/ecommerce')

In [6]:
produtos = pd.read_sql("SELECT * FROM produtos;", engine); produtos.head(10)

     codigo                                            produto   preco
0  BS001873                              Apple Lightning Cable   21.99
1  BS001874                          SanDisk Extreme microSDXC   31.50
2  BS001875                 Seagate 2TB Expansion Portable HDD   79.00
3  BS001876       TicWatch Pro 3 Ultra GPS Smartwatch Qualcomm  399.00
4  BS001877                         Webcam HD 1080p Web Camera   59.00
5  BS001878  Logitech MK270R Wireless Keyboard and Mouse Combo   38.00
6  BS001879                        Samsung T37F Monitor UHD 37  299.00
7  BS001880  HyperX QuadCast S – RGB USB Condenser Micropho...  213.00
8  BS001881        TP-Link Tapo Pan/Tilt Smart Security Camera   66.43
9  BS001882  HEYMIX Powerboard, Power Strip with 8 Outlets,...   52.49

In [7]:
vendas = pd.read_sql("SELECT * FROM vendas;", engine); vendas.head(10)

,Order ID,Date,ship-service-level,Style,Codigo,Courier Status,Qty,ship-country,Fulfillment
0,171-8536041-9190708,2022-06-29,Expedited,SET400,BS001879,Cancelled,4,AU,Yes
1,407-4176879-6571509,2022-06-29,Expedited,JNE3486,BS001890,Cancelled,2,BR,Yes
2,404-4382011-4681149,2022-06-29,Expedited,JNE3887,BS001873,Cancelled,2,BR,Yes
3,406-3412504-2471555,2022-06-29,Expedited,JNE3487,BS001888,Cancelled,2,BR,Yes
4,408-2481787-8248368,2022-06-29,Expedited,JNE3566,BS001898,Cancelled,2,BR,Yes
5,406-7522239-7644307,2022-06-29,Expedited,SET286,BS001900,Cancelled,2,BR,Yes
6,402-5789132-5926724,2022-06-29,Expedited,JNE3675,BS001891,Cancelled,5,BR,Yes
7,406-3380662-9728336,2022-06-29,Expedited,J0157,BS001887,Cancelled,3,BR,Yes
8,402-2465163-9329126,2022-06-29,Expedited,J0337,BS001897,Cancelled,4,BR,Yes
9,407-2688982-0165102,2022-06-29,Expedited,JNE3697,BS001884,Cancelled,3,BR,Yes

In [13]:
#01 Quantos produtos diferentes temos?
df_total_produtos = pd.read_sql("SELECT * FROM vw_total_produtos;", engine); df_total_produtos.head()

   total_produtos
0              29

In [14]:
#02 Qual é o preço médio dos produtos?
df_preco_medio = pd.read_sql("SELECT * FROM vw_preco_medio;", engine); df_preco_medio.head()

   preco_medio
0   162.147586

In [15]:
#03 Quais são os produtos mais caros?
df_produtos_mais_caros = pd.read_sql("SELECT * FROM vw_produtos_mais_caros;", engine); df_produtos_mais_caros.head()

                                             produto   preco
0    LEGO Ideas Home Alone McCallisters’ House 21330  449.00
1       TicWatch Pro 3 Ultra GPS Smartwatch Qualcomm  399.00
2  Sony WH1000XM4 Noise Canceling Wireless Headph...  385.00
3                       Nintendo Switch Console Lite  329.95
4    PHILIPS Sonicare 9900 Prestige Power Toothbrush  329.00

In [16]:
#04 Quantos pedidos foram cancelados?
df_pedidos_cancelados = pd.read_sql("SELECT * FROM vw_pedidos_cancelados;", engine); df_pedidos_cancelados.head()

   total_cancelados
0              6071

In [17]:
#05 Qual é a data mais comum para envio?
df_data_envio = pd.read_sql("SELECT * FROM vw_data_envio;", engine); df_data_envio.head()

         Date  total_pedidos
0  2022-05-03           2085

In [18]:
#06 Qual é o mês com mais vendas?
df_mes_mais_vendas = pd.read_sql("SELECT * FROM vw_mes_mais_vendas;", engine); df_mes_mais_vendas.head()

   mes  total_vendas
0  4.0         49067

In [21]:
#07 Qual é o país com mais vendas?
df_pais_mais_vendas = pd.read_sql("SELECT * FROM vw_pais_mais_vendas;", engine); df_pais_mais_vendas.head()

  ship-country  total_vendas
0           BR         14384

In [22]:
#08 Total de vendas por país:
df_total_vendas_por_pais = pd.read_sql("SELECT * FROM vw_total_vendas_por_pais;", engine); df_total_vendas_por_pais.head()

  ship-country  total_vendas
0           BR         14384
1           AU         14325
2           DK         14325
3           UK         14323
4           GE         14322

In [23]:
#09 Qual é o total de vendas enviadas?
df_vendas_enviadas = pd.read_sql("SELECT * FROM vw_vendas_enviadas;", engine); df_vendas_enviadas.head()

   total_enviado
0         116063

In [24]:
#10 Qual é o país com a maior média de produtos por pedido?
df_media_produtos_por_pedido_pais = pd.read_sql("SELECT * FROM media_produtos_por_pedido_pais;", engine); df_media_produtos_por_pedido_pais.head()

  ship-country  media_produtos
0           JP        3.008938